{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js Converter v3.20.0",
    "convertedBy": "Jellyfin Upscaler Plugin",
    "version": "deep",
    "modelTopology": {
        "class_name": "VDSR",
        "config": [
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 64,
                    "kernel_size": [3, 3],
                    "padding": "same",
                    "activation": "relu",
                    "name": "conv_1"
                }
            },
            {
                "class_name": "VDSRResidualLayer",
                "config": {
                    "filters": 64,
                    "kernel_size": [3, 3],
                    "depth": 18,
                    "name": "residual_layers"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 3,
                    "kernel_size": [3, 3],
                    "padding": "same",
                    "activation": "linear",
                    "name": "conv_final"
                }
            }
        ]
    },
    "weightsManifest": [
        {
            "paths": ["weights.bin"],
            "weights": [
                {
                    "name": "conv_1/kernel",
                    "shape": [3, 3, 3, 64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_1/bias",
                    "shape": [64],
                    "dtype": "float32"
                },
                {
                    "name": "residual_layers/conv_2/kernel",
                    "shape": [3, 3, 64, 64],
                    "dtype": "float32"
                },
                {
                    "name": "residual_layers/conv_2/bias",
                    "shape": [64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_final/kernel",
                    "shape": [3, 3, 64, 3],
                    "dtype": "float32"
                },
                {
                    "name": "conv_final/bias",
                    "shape": [3],
                    "dtype": "float32"
                }
            ]
        }
    ],
    "metadata": {
        "description": "Very Deep Super Resolution - Deep Network with Skip Connections",
        "architecture": "VDSR",
        "scale": [2, 3, 4],
        "optimizedFor": ["multi-scale", "deep-features", "residual-learning"],
        "requirements": {
            "minVRAM": "3GB",
            "recommendedVRAM": "6GB",
            "performance": "medium-high"
        },
        "features": [
            "very-deep-network",
            "multi-scale-training",
            "residual-learning",
            "skip-connections",
            "gradient-clipping"
        ],
        "benchmarks": {
            "inference_time": "250ms @ 1080p",
            "psnr_improvement": "0.7-1.2dB over SRCNN"
        }
    }
}