{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js Converter v3.20.0",
    "convertedBy": "Jellyfin Upscaler Plugin",
    "version": "x4plus",
    "modelTopology": {
        "class_name": "Sequential",
        "config": [
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 64,
                    "kernel_size": [3, 3],
                    "padding": "same",
                    "activation": "relu",
                    "name": "conv_input"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 64,
                    "kernel_size": [3, 3],
                    "padding": "same",
                    "activation": "relu",
                    "name": "conv_1"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 64,
                    "kernel_size": [3, 3],
                    "padding": "same",
                    "activation": "relu",
                    "name": "conv_2"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 64,
                    "kernel_size": [3, 3],
                    "padding": "same",
                    "activation": "relu",
                    "name": "conv_3"
                }
            },
            {
                "class_name": "UpSampling2D",
                "config": {
                    "size": [2, 2],
                    "interpolation": "bilinear",
                    "name": "upsampling_1"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 64,
                    "kernel_size": [3, 3],
                    "padding": "same",
                    "activation": "relu",
                    "name": "conv_up_1"
                }
            },
            {
                "class_name": "UpSampling2D",
                "config": {
                    "size": [2, 2],
                    "interpolation": "bilinear",
                    "name": "upsampling_2"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 3,
                    "kernel_size": [3, 3],
                    "padding": "same",
                    "activation": "tanh",
                    "name": "conv_output"
                }
            }
        ]
    },
    "weightsManifest": [
        {
            "paths": ["weights.bin"],
            "weights": [
                {
                    "name": "conv_input/kernel",
                    "shape": [3, 3, 3, 64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_input/bias",
                    "shape": [64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_1/kernel",
                    "shape": [3, 3, 64, 64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_1/bias",
                    "shape": [64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_2/kernel",
                    "shape": [3, 3, 64, 64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_2/bias",
                    "shape": [64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_3/kernel",
                    "shape": [3, 3, 64, 64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_3/bias",
                    "shape": [64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_up_1/kernel",
                    "shape": [3, 3, 64, 64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_up_1/bias",
                    "shape": [64],
                    "dtype": "float32"
                },
                {
                    "name": "conv_output/kernel",
                    "shape": [3, 3, 64, 3],
                    "dtype": "float32"
                },
                {
                    "name": "conv_output/bias",
                    "shape": [3],
                    "dtype": "float32"
                }
            ]
        }
    ],
    "metadata": {
        "description": "Real-ESRGAN x4plus model for practical image restoration",
        "architecture": "Real-ESRGAN",
        "scale": 4,
        "optimizedFor": ["photos", "videos", "general"],
        "requirements": {
            "minVRAM": "2GB",
            "recommendedVRAM": "4GB",
            "performance": "high"
        }
    }
}