{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js Converter v3.20.0",
    "convertedBy": "Jellyfin Upscaler Plugin",
    "version": "large",
    "modelTopology": {
        "class_name": "SwinIR",
        "config": [
            {
                "class_name": "PatchEmbed",
                "config": {
                    "patch_size": 1,
                    "in_chans": 3,
                    "embed_dim": 180,
                    "norm_layer": "LayerNorm"
                }
            },
            {
                "class_name": "SwinTransformerBlock",
                "config": {
                    "dim": 180,
                    "num_heads": 6,
                    "window_size": 8,
                    "shift_size": 0,
                    "mlp_ratio": 2.0,
                    "qkv_bias": true,
                    "drop": 0.0,
                    "attn_drop": 0.0,
                    "drop_path": 0.0
                }
            },
            {
                "class_name": "PatchUnEmbed",
                "config": {
                    "patch_size": 1,
                    "in_chans": 3,
                    "embed_dim": 180
                }
            },
            {
                "class_name": "Upsample",
                "config": {
                    "scale": 4,
                    "num_feat": 180
                }
            }
        ]
    },
    "weightsManifest": [
        {
            "paths": ["weights.bin"],
            "weights": [
                {
                    "name": "patch_embed/proj/weight",
                    "shape": [180, 3, 1, 1],
                    "dtype": "float32"
                },
                {
                    "name": "patch_embed/proj/bias",
                    "shape": [180],
                    "dtype": "float32"
                },
                {
                    "name": "layers/0/blocks/0/norm1/weight",
                    "shape": [180],
                    "dtype": "float32"
                },
                {
                    "name": "layers/0/blocks/0/norm1/bias",
                    "shape": [180],
                    "dtype": "float32"
                }
            ]
        }
    ],
    "metadata": {
        "description": "SwinIR - Image Restoration Using Swin Transformer",
        "architecture": "SwinTransformer",
        "scale": 4,
        "optimizedFor": ["photos", "realistic-images", "classical-sr"],
        "requirements": {
            "minVRAM": "4GB",
            "recommendedVRAM": "8GB",
            "performance": "very-high"
        },
        "features": [
            "self-attention",
            "window-based-processing",
            "hierarchical-feature-learning",
            "artifact-reduction"
        ]
    }
}