{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js Converter v3.20.0",
    "convertedBy": "Jellyfin Upscaler Plugin",
    "version": "baseline",
    "modelTopology": {
        "class_name": "EDSR",
        "config": [
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 256,
                    "kernel_size": [3, 3],
                    "padding": "same",
                    "activation": "linear",
                    "name": "head_conv"
                }
            },
            {
                "class_name": "ResidualBlock",
                "config": {
                    "filters": 256,
                    "kernel_size": [3, 3],
                    "res_scale": 0.1,
                    "name": "res_block_1"
                }
            },
            {
                "class_name": "ResidualBlock",
                "config": {
                    "filters": 256,
                    "kernel_size": [3, 3],
                    "res_scale": 0.1,
                    "name": "res_block_2"
                }
            },
            {
                "class_name": "ResidualBlock",
                "config": {
                    "filters": 256,
                    "kernel_size": [3, 3],
                    "res_scale": 0.1,
                    "name": "res_block_3"
                }
            },
            {
                "class_name": "ResidualBlock",
                "config": {
                    "filters": 256,
                    "kernel_size": [3, 3],
                    "res_scale": 0.1,
                    "name": "res_block_4"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 256,
                    "kernel_size": [3, 3],
                    "padding": "same",
                    "activation": "linear",
                    "name": "body_conv"
                }
            },
            {
                "class_name": "PixelShuffle",
                "config": {
                    "scale": 4,
                    "name": "upsampler"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "filters": 3,
                    "kernel_size": [3, 3],
                    "padding": "same",
                    "activation": "linear",
                    "name": "tail_conv"
                }
            }
        ]
    },
    "weightsManifest": [
        {
            "paths": ["weights.bin"],
            "weights": [
                {
                    "name": "head_conv/kernel",
                    "shape": [3, 3, 3, 256],
                    "dtype": "float32"
                },
                {
                    "name": "head_conv/bias",
                    "shape": [256],
                    "dtype": "float32"
                },
                {
                    "name": "res_block_1/conv1/kernel",
                    "shape": [3, 3, 256, 256],
                    "dtype": "float32"
                },
                {
                    "name": "res_block_1/conv1/bias",
                    "shape": [256],
                    "dtype": "float32"
                },
                {
                    "name": "res_block_1/conv2/kernel",
                    "shape": [3, 3, 256, 256],
                    "dtype": "float32"
                },
                {
                    "name": "res_block_1/conv2/bias",
                    "shape": [256],
                    "dtype": "float32"
                },
                {
                    "name": "body_conv/kernel",
                    "shape": [3, 3, 256, 256],
                    "dtype": "float32"
                },
                {
                    "name": "body_conv/bias",
                    "shape": [256],
                    "dtype": "float32"
                },
                {
                    "name": "tail_conv/kernel",
                    "shape": [3, 3, 3, 3],
                    "dtype": "float32"
                },
                {
                    "name": "tail_conv/bias",
                    "shape": [3],
                    "dtype": "float32"
                }
            ]
        }
    ],
    "metadata": {
        "description": "Enhanced Deep Residual Networks for Single Image Super-Resolution",
        "architecture": "EDSR",
        "scale": 4,
        "optimizedFor": ["photos", "natural-images", "benchmarks"],
        "requirements": {
            "minVRAM": "3GB",
            "recommendedVRAM": "6GB",
            "performance": "high"
        },
        "features": [
            "residual-scaling",
            "skip-connections",
            "deep-architecture",
            "pixel-shuffle-upsampling"
        ]
    }
}